# CircuitNamingSchemeSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CircuitNamingSchemeSettings Class
Members See Also
---
This class represents a circuit naming scheme settings in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public class CircuitNamingSchemeSettings : Element
```

Visual Basic
---
```text
Public Class CircuitNamingSchemeSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class CircuitNamingSchemeSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Electrical..::..CircuitNamingSchemeSettings
# See Also
CircuitNamingSchemeSettings Members
Autodesk.Revit.DB.Electrical Namespace